<?php

return [
    'zone'  => ['东城', '西城', '朝阳', '海淀', '丰台', '石景山', '通州', '昌平', '大兴', '亦庄', '顺义','房山','门头沟','平谷','怀柔','密云','延庆'],

    'warehouse'   => [
        'class'         => ['小五金', '电气类', '水暖件类', '工具类', '量具类', '劳保用品类', '化学用品类', '水产类', '水电费', '刀具类'],
        'orientation'   => ['东', '南', '西', '北', '东北', '西北', '东南', '西南'],
        'price'     => [
            ['string' => '1000元以下', 'value' => '-1000'],
            ['string' => '1000-3000元', 'value' => '1000-5000'],
            ['string' => '3000-5000元', 'value' => '3000-5000'],
            ['string' => '5000-10000元', 'value' => '5000-10000'],
            ['string' => '10000-20000元', 'value' => '10000-20000'],
            ['string' => '20000元以上', 'value' => '20000-'],
        ],
        'price_type'    => ['元/m3/天', '元/月'],
    ],
    'vehicle'  => [
        'class'         => ['货车', '出租车', '特殊车辆', '面包车'],
        'length'      => ['3米','4米','4.2米','4.5米','5.3米','6米','6.2米','6.8米','7.7米','8米','8.2米','8.7米','9.2米'],
        'price_type'   => ['元/天' , '元/公里'],
        'load_type'   => ['吨' , '人'],
        'price'     => [
            ['string' => '1000元以下', 'value' => '-1000'],
            ['string' => '1000-3000元', 'value' => '1000-5000'],
            ['string' => '3000-5000元', 'value' => '3000-5000'],
            ['string' => '5000-10000元', 'value' => '5000-10000'],
            ['string' => '10000-20000元', 'value' => '10000-20000'],
            ['string' => '20000元以上', 'value' => '20000-'],
        ],
        'gearbox'  =>  ['手动','自动'],
        'use'       => ['物流','长途货运','短途货运'],
        'driver' => ['带司机','自驾'],
    ],
    'personal'  => [
        'class'         => ['人力', '行政', '管理', '销售', '市场', '网络', '法律', '教育', '医疗', '环保'],
        'education'     => ['不限', '小学', '初中', '高中', '中专', '大专', '本科', '研究生', '博士'],
        'working_age'   => ['1年内', '1-3年', '3-5年', '5-10年', '10-15年', '15年以上'],
        'price_type'    => ['元/天', '元/月'],
        'benefits'      => ['五险一金', '包住', '包吃', '双休', '交通补助', '饭补', '车补'],
        'sex'           => ['男','女'],
        'price'     => [
            ['string' => '1000元以下', 'value' => '-1000'],
            ['string' => '1000-3000元', 'value' => '1000-5000'],
            ['string' => '3000-5000元', 'value' => '3000-5000'],
            ['string' => '5000-10000元', 'value' => '5000-10000'],
            ['string' => '10000-20000元', 'value' => '10000-20000'],
            ['string' => '20000元以上', 'value' => '20000-'],
        ],
    ],
];